{
    "medicines": [
        {
            "name": "Paracetamol",
            "generic_name": "Acetaminophen",
            "brand_name": "Tylenol",
            "category": "Analgesic",
            "manufacturer": "Johnson & Johnson",
            "description": "Paracetamol is a pain reliever and fever reducer. It is used to treat many conditions such as headache, muscle aches, arthritis, backache, toothaches, colds, and fevers.",
            "uses": "Used to relieve pain and reduce fever. Common uses include headache, muscle pain, arthritis, backache, toothache, cold, and fever.",
            "dosage": "Adults: 500-1000mg every 4-6 hours as needed. Maximum 4000mg per day.",
            "side_effects": "Common side effects include nausea, vomiting, and stomach pain. Rare but serious side effects include liver problems.",
            "precautions": "Do not exceed recommended dosage. Avoid alcohol. Consult doctor if pregnant or breastfeeding.",
            "interactions": "May interact with blood thinners and certain antibiotics.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Aspirin",
            "generic_name": "Acetylsalicylic Acid",
            "brand_name": "Bayer",
            "category": "NSAID",
            "manufacturer": "Bayer",
            "description": "Aspirin is a nonsteroidal anti-inflammatory drug (NSAID) used to treat pain, fever, and inflammation.",
            "uses": "Used to relieve pain, reduce fever, and prevent blood clots. Also used to prevent heart attacks and strokes.",
            "dosage": "Pain/Fever: 325-650mg every 4-6 hours. Heart attack prevention: 81-325mg daily.",
            "side_effects": "Common side effects include stomach upset, heartburn, and drowsiness. May cause bleeding problems.",
            "precautions": "Not recommended for children with viral infections. Avoid if allergic to salicylates.",
            "interactions": "May interact with blood thinners, other NSAIDs, and certain antidepressants.",
            "storage": "Store in a cool, dry place away from moisture."
        },
        {
            "name": "Amoxicillin",
            "generic_name": "Amoxicillin Trihydrate",
            "brand_name": "Amoxil",
            "category": "Antibiotic",
            "manufacturer": "GlaxoSmithKline",
            "description": "Amoxicillin is a penicillin antibiotic that fights bacteria in the body.",
            "uses": "Used to treat bacterial infections such as ear infections, throat infections, and urinary tract infections.",
            "dosage": "Adults: 250-500mg every 8 hours. Children: 20-40mg/kg per day in divided doses.",
            "side_effects": "Common side effects include diarrhea, nausea, and rash. May cause allergic reactions.",
            "precautions": "Complete the full course of antibiotics. Inform doctor of any allergies.",
            "interactions": "May interact with other antibiotics and birth control pills.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Omeprazole",
            "generic_name": "Omeprazole Magnesium",
            "brand_name": "Prilosec",
            "category": "Proton Pump Inhibitor",
            "manufacturer": "AstraZeneca",
            "description": "Omeprazole reduces the amount of acid produced in the stomach.",
            "uses": "Used to treat heartburn, acid reflux, and stomach ulcers.",
            "dosage": "20-40mg once daily before meals.",
            "side_effects": "Common side effects include headache, diarrhea, and stomach pain.",
            "precautions": "Long-term use may increase risk of bone fractures. Consult doctor if pregnant.",
            "interactions": "May interact with certain antifungal medications and iron supplements.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Metformin",
            "generic_name": "Metformin Hydrochloride",
            "brand_name": "Glucophage",
            "category": "Antidiabetic",
            "manufacturer": "Bristol-Myers Squibb",
            "description": "Metformin is an oral diabetes medicine that helps control blood sugar levels.",
            "uses": "Used to treat type 2 diabetes. May be used with diet and exercise to improve blood sugar control.",
            "dosage": "500-2000mg daily in divided doses with meals.",
            "side_effects": "Common side effects include nausea, diarrhea, and vitamin B12 deficiency.",
            "precautions": "Monitor kidney function. Avoid excessive alcohol consumption.",
            "interactions": "May interact with certain contrast dyes and other diabetes medications.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Ibuprofen",
            "generic_name": "Ibuprofen",
            "brand_name": "Advil, Motrin",
            "category": "NSAID",
            "manufacturer": "Pfizer",
            "description": "Ibuprofen is a nonsteroidal anti-inflammatory drug (NSAID) used to reduce fever and treat pain or inflammation caused by many conditions such as headache, toothache, back pain, arthritis, menstrual cramps, or minor injury.",
            "uses": "Used to relieve pain from various conditions such as headache, dental pain, menstrual cramps, muscle aches, or arthritis. Also used to reduce fever and to relieve minor aches and pain due to the common cold or flu.",
            "dosage": "Adults: 200-400mg every 4-6 hours as needed. Maximum 1200mg per day.",
            "side_effects": "Common side effects include stomach pain, constipation, diarrhea, gas, heartburn, nausea, vomiting, and dizziness.",
            "precautions": "Not recommended for people with heart disease, high blood pressure, or stomach problems. Avoid alcohol. Consult doctor if pregnant or breastfeeding.",
            "interactions": "May interact with blood thinners, other NSAIDs, and certain antidepressants.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Cetirizine",
            "generic_name": "Cetirizine Hydrochloride",
            "brand_name": "Zyrtec",
            "category": "Antihistamine",
            "manufacturer": "Johnson & Johnson",
            "description": "Cetirizine is an antihistamine that reduces the effects of natural chemical histamine in the body. Histamine can produce symptoms of sneezing, itching, watery eyes, and runny nose.",
            "uses": "Used to treat cold or allergy symptoms such as sneezing, itching, watery eyes, or runny nose. Also used to treat itching and swelling caused by chronic urticaria (hives).",
            "dosage": "Adults and children 6 years and older: 5-10mg once daily. Children 2-5 years: 2.5-5mg once daily.",
            "side_effects": "Common side effects include drowsiness, tiredness, and dry mouth.",
            "precautions": "May cause drowsiness. Avoid alcohol. Consult doctor if pregnant or breastfeeding.",
            "interactions": "May interact with other medications that cause drowsiness.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Azithromycin",
            "generic_name": "Azithromycin Dihydrate",
            "brand_name": "Zithromax",
            "category": "Antibiotic",
            "manufacturer": "Pfizer",
            "description": "Azithromycin is a macrolide antibiotic that fights bacteria in the body. It is used to treat many different types of infections caused by bacteria.",
            "uses": "Used to treat bacterial infections such as respiratory infections, skin infections, ear infections, and sexually transmitted diseases.",
            "dosage": "Typical dose: 500mg on day 1, followed by 250mg once daily on days 2-5.",
            "side_effects": "Common side effects include diarrhea, nausea, stomach pain, and vomiting.",
            "precautions": "Complete the full course of antibiotics. Inform doctor of any allergies.",
            "interactions": "May interact with antacids and certain heart medications.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Atorvastatin",
            "generic_name": "Atorvastatin Calcium",
            "brand_name": "Lipitor",
            "category": "Statins",
            "manufacturer": "Pfizer",
            "description": "Atorvastatin is a statin that reduces levels of bad cholesterol and triglycerides in the blood, while increasing levels of good cholesterol.",
            "uses": "Used to treat high cholesterol and to lower the risk of stroke, heart attack, or other heart complications in people with type 2 diabetes, coronary heart disease, or other risk factors.",
            "dosage": "10-80mg once daily, usually in the evening.",
            "side_effects": "Common side effects include muscle pain, diarrhea, and joint pain.",
            "precautions": "Avoid alcohol. Regular blood tests may be required. Not recommended during pregnancy.",
            "interactions": "May interact with certain antibiotics, antifungal medications, and other cholesterol-lowering drugs.",
            "storage": "Store at room temperature away from moisture and heat."
        },
        {
            "name": "Pantoprazole",
            "generic_name": "Pantoprazole Sodium",
            "brand_name": "Protonix",
            "category": "Proton Pump Inhibitor",
            "manufacturer": "Wyeth",
            "description": "Pantoprazole reduces the amount of acid produced in the stomach. It is used to treat erosive esophagitis and other conditions involving excess stomach acid.",
            "uses": "Used to treat erosive esophagitis, Zollinger-Ellison syndrome, and other conditions involving excess stomach acid.",
            "dosage": "20-40mg once daily before meals.",
            "side_effects": "Common side effects include headache, diarrhea, and stomach pain.",
            "precautions": "Long-term use may increase risk of bone fractures. Consult doctor if pregnant.",
            "interactions": "May interact with certain antifungal medications and iron supplements.",
            "storage": "Store at room temperature away from moisture and heat."
        }
    ]
} 